Documents/ОбещанияВыполения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОбещанияВыполения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияКомплект</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеКомплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОбещанияВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбещанияВыполнения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбещания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбещаниеВыполнения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбещанияВыполения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИзделияКомплект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияКомплект</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВнешнегоСоглосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКомпозиции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Композиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаУтверждение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Монтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Производства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПодряд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОписаниеДетали</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбразец</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Образец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Образец</v8:Type>
								<v8:Type>cfg:CatalogRef.ПредварительныйОбразец</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ОбещанияВыполения/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем мДанныеТЧ;

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь; 
	Иначе
		ЗаполнитьДанные();
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДанные()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбещанияВыполенияИзделияКомплект.ИзделиеКомплект КАК ИзделиеКомплект,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбещанияВыполнения.ДатаОбещания) КАК КоличествоОбещаний
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.ОбещанияВыполения.ИзделияКомплект КАК ОбещанияВыполенияИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбещанияВыполнения КАК ОбещанияВыполнения
		|		ПО ОбещанияВыполенияИзделияКомплект.ИзделиеКомплект = ОбещанияВыполнения.ИзделиеКомплект
		|			И ОбещанияВыполенияИзделияКомплект.Ссылка = ОбещанияВыполнения.ОбещаниеВыполнения
		|ГДЕ
		|	ОбещанияВыполенияИзделияКомплект.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбещанияВыполенияИзделияКомплект.ИзделиеКомплект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт.ИзделиеКомплект КАК ИзделиеКомплект,
		|	вт.КоличествоОбещаний КАК КоличествоОбещаний,
		|	ОбещанияВыполненияСрезПоследних.ДатаОбещания КАК ДатаОбещания,
		|	ОбещанияВыполненияСрезПоследних.Комментарий КАК Комментарий
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбещанияВыполнения.СрезПоследних(, ОбещаниеВыполнения = &Ссылка) КАК ОбещанияВыполненияСрезПоследних
		|		ПО вт.ИзделиеКомплект = ОбещанияВыполненияСрезПоследних.ИзделиеКомплект";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	стОтбор = Новый Структура("ИзделиеКомплект", );
	
	Пока Выборка.Следующий() Цикл
		
		стОтбор.ИзделиеКомплект = Выборка.ИзделиеКомплект;
		
		НайденыеСтроки = Объект.ИзделияКомплект.НайтиСтроки(стОтбор);
		
		Для каждого х Из НайденыеСтроки Цикл
			ЗаполнитьЗначенияСвойств(х, Выборка);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПроектНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.ИзделияЗаказчика.Количество() = 0 Тогда 
		ОткрытьФормуВыбораПроекта();
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОСменеПроекта",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения,"При смене Проекта будет очищена табличная часть. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли; 
	
КонецПроцедуры 


&НаКлиенте
Процедура ПослеВопросаОСменеПроекта(Результат, ДополнительныйПараметр) Экспорт
	
	Если Результат = КодВозвратаДиалога.ДА Тогда
        ОткрытьФормуВыбораПроекта();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьМассивПроектовОжидания()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Ссылка КАК Проект
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбещанияВыполения КАК ОбещанияВыполения
		|		ПО ОбещанияВыполения.Проект = Проекты.Ссылка
		|ГДЕ
		|	НЕ Проекты.ПометкаУдаления
		|	И ОбещанияВыполения.Ссылка ЕСТЬ NULL";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Проект");
	

КонецФункции // ПолучитьМассивПроектовОжидания()

&НаКлиенте
Процедура ОткрытьФормуВыбораПроекта()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",		Ложь);
	ПараметрыФормы.Вставить("НеПоказыватьСделки",		Истина);
	ПараметрыФормы.Вставить("МассивПроектовПоказывать",	ПолучитьМассивПроектовОжидания());

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыборкаПроекта", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Проекты.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОткрытьФормуВыбораПроекта()

&НаКлиенте
Процедура ПослеВыборкаПроекта(Значение, ДополнительныйПараметр) Экспорт

    Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        Возврат;
	КонецЕсли;
	
	Объект.Проект = Значение;
	Объект.ИзделияЗаказчика.Очистить();
	
КонецПроцедуры


Процедура ЗаполнитьИзделияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спрИзделияКомплект.Ссылка КАК ИзделиеКомплект,
		|	ОбещанияВыполненияСрезПоследних.ДатаОбещания КАК ДатаОбещания,
		|	ОбещанияВыполненияСрезПоследних.Комментарий КАК Комментарий
		|ИЗ
		|	Справочник.ИзделияКомплект КАК спрИзделияКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбещанияВыполнения.СрезПоследних КАК ОбещанияВыполненияСрезПоследних
		|		ПО (ОбещанияВыполненияСрезПоследних.ИзделиеКомплект = ОбещанияВыполненияСрезПоследних.ИзделиеКомплект.Ссылка)
		|ГДЕ
		|	НЕ спрИзделияКомплект.Ссылка В (&Ссылка)
		|	И НЕ спрИзделияКомплект.ЭтоГруппа
		|	И спрИзделияКомплект.Проект = &Проект
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбещанияВыполненияСрезПоследних.ИзделиеКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Проект", Объект.Проект);
	Запрос.УстановитьПараметр("Ссылка", Объект.ИзделияКомплект.Выгрузить().ВыгрузитьКолонку("ИзделиеКомплект"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.ИзделияКомплект.Добавить(), Выборка);	
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьИзделия(Команда)
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		ЗаполнитьИзделияНаСервере();
	Иначе
	   	ПоказатьПредупреждение(, "Не заполнена Проект");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	мДанныеТЧ = Новый Массив;
	
	Для каждого х Из Объект.ИзделияКомплект Цикл
		
		стДанных = Новый Структура("ИзделиеКомплект, ДатаОбещания, Комментарий, Помещение", );
		ЗаполнитьЗначенияСвойств(стДанных, х);
		мДанныеТЧ.Добавить(стДанных);
	
	КонецЦикла;
	
КонецПроцедуры 

 &НаСервереБезКонтекста
 Функция ЗаписатьДаннымиПослеЗаписи(ОбещаниеВыполнения, Сделка, мДанныеТЧ, Дата)
	 
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
		 "ВЫБРАТЬ
		 |	ОбещанияВыполненияСрезПоследних.ИзделиеКомплект КАК ИзделиеКомплект,
		 |	ОбещанияВыполненияСрезПоследних.ДатаОбещания КАК ДатаОбещания,
		 |	ОбещанияВыполненияСрезПоследних.Комментарий КАК Комментарий,
		 |	ЛОЖЬ КАК Обработан
		 |ИЗ
		 |	РегистрСведений.ОбещанияВыполнения.СрезПоследних(, ОбещаниеВыполнения В (&ОбещаниеВыполнения)) КАК ОбещанияВыполненияСрезПоследних
		 |";
	 
	 Запрос.УстановитьПараметр("ОбещаниеВыполнения", ОбещаниеВыполнения);
	 
	 СуществующиеКомплекты = Запрос.Выполнить().Выгрузить(); 
	 СуществующиеКомплекты.Индексы.Добавить("ИзделиеКомплект");
	 
	 ПустаяДата = Дата(1, 1, 1);
	 
	 Для каждого х Из мДанныеТЧ Цикл
		 
		 НайденаяСтрока = СуществующиеКомплекты.найти(х.ИзделиеКомплект, "ИзделиеКомплект");
		 Если НЕ НайденаяСтрока = Неопределено Тогда
			 
			 НайденаяСтрока.Обработан = Истина;
			 
			 Если НайденаяСтрока.ДатаОбещания  =  х.ДатаОбещания И НайденаяСтрока.Комментарий = х.Комментарий Тогда
				 Продолжить;
			 КонецЕсли;
			 
		 КонецЕсли;
		 
		 
		 
		 НаборЗаписей = РегистрыСведений.ОбещанияВыполнения.СоздатьНаборЗаписей();
		 НаборЗаписей.Отбор.ИзделиеКомплект.Установить(х.ИзделиеКомплект);
		 НаборЗаписей.Отбор.Период.Установить(Дата);
		 
		 НоваяЗапись = НаборЗаписей.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяЗапись, х);
		 НоваяЗапись.ОбещаниеВыполнения 	= ОбещаниеВыполнения;
		 НоваяЗапись.Проект 				= Сделка;
		 НоваяЗапись.Период 				= Дата;
		 
		 НаборЗаписей.Записать(); 
		 
	 КонецЦикла;
	 
	 Для каждого УдаленныйКомплект Из СуществующиеКомплекты Цикл
		 
		 Если УдаленныйКомплект.Обработан Тогда
			 Продолжить; 
		 КонецЕсли;
		 
		 НаборЗаписей = РегистрыСведений.ОбещанияВыполнения.СоздатьНаборЗаписей();
		 НаборЗаписей.Отбор.ИзделиеКомплект.Установить(УдаленныйКомплект);
		 НаборЗаписей.Отбор.Период.Установить(Дата);
		 
		 НоваяЗапись = НаборЗаписей.Добавить();
		 НоваяЗапись.ИзделиеКомплект 		= УдаленныйКомплект;
		 НоваяЗапись.ОбещаниеВыполнения 	= ОбещаниеВыполнения;
		 НоваяЗапись.Комментарий 			= "";
		 НоваяЗапись.ДатаОбещания 			= Дата(1, 1, 1);
		 НоваяЗапись.Проект 				= Сделка;
		 НоваяЗапись.Период 				= Дата;
		 
		 НаборЗаписей.Записать(); 
		 
	 КонецЦикла;
	 
	 
 КонецФункции // ЗаполнитьДаннымиПослеЗаписи()

&НаКлиенте
 Процедура ПослеЗаписи(ПараметрыЗаписи)
	 ЗаписатьДаннымиПослеЗаписи(Объект.Ссылка, Объект.Проект, мДанныеТЧ, ТекущаяДата());
 КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИзделиеКомплект(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;                         
	
	Если ДополнительныеПараметры = Неопределено Тогда
		НС = Объект.ИзделияКомплект.Добавить();
		НС.ИзделиеКомплект = Результат; 
	Иначе
		ДополнительныеПараметры.ТД.ИзделиеКомплект = Результат;	
	КонецЕсли;
КонецПроцедуры // ПослеВыбораЭлементовСделки()

&НаКлиенте
Процедура ИзделиеКомплектПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Если ЗначениеЗаполнено(Объект.Проект) Тогда
		НеПоказыватьИзделиеКомплект = Новый Массив;
		
		Для каждого х Из Объект.ИзделияКомплект Цикл
			НеПоказыватьИзделиеКомплект.Добавить(х.ИзделиеКомплект);	
		КонецЦикла;
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораИзделиеКомплект", ЭтаФорма);
		
		стПараметры = Новый Структура("Проект", 	Объект.Проект); 
		стПараметры.Вставить("НеПоказыватьВВыборе", НеПоказыватьИзделиеКомплект);
		
		ОткрытьФорму("Справочник.ИзделияКомплект.ФормаВыбора",стПараметры,ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	Иначе	
		ПоказатьПредупреждение(,"Не заполнена Проект");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ГрупповоеНазначение(Команда)
	
	мИзделияКомплект = Новый Массив;
	
	Для каждого х Из Элементы.ИзделияКомплект.ВыделенныеСтроки Цикл
		мИзделияКомплект.Добавить(Объект.ИзделияКомплект.НайтиПоИдентификатору(х).ИзделиеКомплект);	
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаполнениеКомментариев", ЭтаФорма, мИзделияКомплект);
	
	ОткрытьФорму("Документ.ОбещанияВыполения.Форма.ФормаНазначениеКомментария", 
				Новый Структура("мИзделияКомплект", мИзделияКомплект), 
				ЭтаФорма, , , , 
				ОписаниеОповещения, 
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполнениеКомментариев(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого х Из объект.ИзделияКомплект Цикл
		
		Если НЕ ДополнительныеПараметры.Найти(х.ИзделиеКомплект) = Неопределено Тогда
			
			х.Комментарий 	= Результат.Комментарий; 
			х.ДатаОбещания 	= Результат.ДатаОбещания; 
		
		КонецЕсли;
		
	
	КонецЦикла;
	

КонецПроцедуры // ПослеЗаполнениеКомментариев()
